readme.org
#+title: consulting spotify
#+date: <2021-01-08 04:02>
#+auto_tangle: t
#+filetags: emacs norss
#+PROPERTY: header-args :tangle no :noweb tangle

/Note/: you can tangle this file (e.g., with =C-c C-v t= inside Emacs)
into three elisp packages ([[./espotify.el][espotify.el]], [[./espotify-consult.el][consult-spotify.el]], and
[[./espotify-embark.el][embark-spotify.el]]) and an example library ([[./espotify-counsel.el][espotify-counsel.el]]).

We have two kinds of interaction with Spotify: via its HTTP API to
perform operations such as search, and via our local DBUS to talk to
client players running in our computer, such as the official client,
[[https://github.com/Spotifyd/spotifyd][spotifyd]] or [[https://mopidy.com/ext/spotify/][mopidy-spotify]].  Our goal is to obtain via the former a
track or album identifier that we can send then to the latter to play,
with emacs completion mechanisms (consult and friends in this case)
providing the glue between both worlds.

Let's start with an umbrella customization group:

#+begin_src emacs-lisp :noweb-ref espotify-customization
  (defgroup espotify nil
    "Access to Spotify API and clients"
    :group 'multimedia)

#+end_src

* Access to Spotify's API: authentication
  :PROPERTIES:
  :header-args: :noweb-ref espotify-body
  :END:

  We start defining a couple of end-points:

  #+begin_src emacs-lisp
    (defvar espotify-spotify-api-url
      "https://api.spotify.com/v1"
      "End-point to access Spotify's REST API.")

    (defvar espotify-spotify-api-authentication-url
      "https://accounts.spotify.com/api/token"
      "End-point to access Spotify's authentication tokens.")

  #+end_src

  And we're going to need as well a client id and secret for our
  application, which i am again defining as variables since i expect
  them to be set in some secure manner instead of via customize:

  #+begin_src emacs-lisp
    (defvar espotify-client-id nil "Spotify application client ID.")

    (defvar espotify-client-secret nil "Spotify application client secret.")

  #+end_src

  To get valid values for them, one just needs to [[https://developer.spotify.com/my-applications][register a Spotify
  application]].  From them we can derive a base64-encoded credentials
  value:

  #+begin_src emacs-lisp
    (defun espotify--basic-auth-credentials ()
      (let ((credential (concat espotify-client-id ":" espotify-client-secret)))
        (concat "Basic " (base64-encode-string credential t))))

  #+end_src

  The return value of the function above is to be used as the
  "Authorization" header of our requests to the authorization
  end-point, which is going to answer with an authorization token
  that we can then use to further requests.  Let's define a function to
  wrap that operation:

  #+begin_src emacs-lisp
    (defvar url-http-end-of-headers)

    (defun espotify--with-auth-token (callback)
      (let ((url-request-method "POST")
            (url-request-data "&grant_type=client_credentials")
            (url-request-extra-headers
             `(("Content-Type" . "application/x-www-form-urlencoded")
               ("Authorization" . ,(espotify--basic-auth-credentials)))))
         (url-retrieve espotify-spotify-api-authentication-url
                       (lambda (_status)
                         (goto-char url-http-end-of-headers)
                         (funcall callback
                                  (alist-get 'access_token (json-read)))))))

  #+end_src

  For instance:
  #+begin_src emacs-lisp :noweb-ref no
    (espotify--with-auth-token
     (lambda (token) (message "Your token is: %s" token)))
  #+end_src

  obtains an auth token and prints it as a message.  Note that ~body~
  is evaluated asynchronously by ~url-retrieve~, so invocations to
  ~espotify-with-auth-token~ evaluate to the request's buffer and are
  usually discarded.

* Search queries using the Spotify API
  :PROPERTIES:
  :header-args: :noweb-ref espotify-body
  :END:

  We are interested in performing a search for some ~term~, of items
  of a given ~types~ (~:track~, ~:album~, ~:artist~, etc.), possibly with an
  additional ~filter~.  That's specified in a GET request's URL
  as constructed by this function:

  #+begin_src emacs-lisp
    (defun espotify--make-search-url (term types &optional filter)
      (when (null types)
        (error "Must supply a non-empty list of types to search for"))
      (let ((term (url-encode-url term)))
        (format "%s/search?q=%s&type=%s&limit=50"
                espotify-spotify-api-url
                (if filter (format "%s:%s" filter term) term)
                (mapconcat #'symbol-name types ","))))

  #+end_src

  For instance:

  #+begin_src emacs-lisp :results replace :noweb-ref no
    (espotify--make-search-url "dream blue turtles" '(album))
  #+end_src

  #+RESULTS:
  : https://api.spotify.com/v1/search?q=dream%20blue%20turtles&type=album&limit=50

  If we have an [[*Access to Spotify's API: authentication][authorisation token]] and a search URL in our hands,
  we can use them as in the following helper function, which will
  calls the given callback with the results of the query:

  #+begin_src emacs-lisp
    (defun espotify--with-query-results (token url callback)
      (let ((url-request-extra-headers
             `(("Authorization" . ,(concat "Bearer " token)))))
        (url-retrieve url
                      (lambda (_status)
                        (goto-char url-http-end-of-headers)
                        (funcall callback
                                 (let ((json-array-type 'list))
                                   (thread-first
                                       (buffer-substring (point) (point-max))
                                     (decode-coding-string 'utf-8)
                                     (json-read-from-string))))))))

  #+end_src

  So we can combine this macro with ~espotify--with-auth-token~ in a
  single search function that takes a callback that will be applied
  to a given query, specified as a triple of term, types and filter:

  #+begin_src emacs-lisp
    (defun espotify-get (callback url)
      "Perform a GET query to URL, receiving its results with CALLBACK."
      (espotify--with-auth-token
         (lambda (token)
           (espotify--with-query-results token url callback))))

    (defun espotify-search (callback term types &optional filter)
      "Perform a search query for TERM, receiving its results with CALLBACK.

    The types of resource we want is given by TYPES, and we can add an additional
    query FILTER."
      (espotify-get callback (espotify--make-search-url term types filter)))

  #+end_src

  For instance:
  #+begin_src emacs-lisp :noweb-ref no
    (defvar espotify-query-result nil)
    (espotify-search (lambda (res) (setq espotify-query-result res))
                     "dream blue turtles"
                     '(album artist))
    (sit-for 0)
  #+end_src

  #+begin_src emacs-lisp :results replace :noweb-ref no
    (mapcar 'car espotify-query-result)
  #+end_src

  #+RESULTS:
  | albums | artists |

  So Spotify is returning a results entry per type, which in turn,
  contains an ~items~ with the list of actual results.  So let's
  provide an interface for a callback that takes as many lists of
  items as types it asks for:

  #+begin_src emacs-lisp
    (defun espotify--type-items (res type)
      (alist-get 'items (alist-get (intern (format "%ss" type)) res)))

    (defun espotify-search* (callback term types &optional filter)
      "Like `espotify-search', but CALLBACK receives lists of items types."
      (let* ((types (if (listp types) types (list types)))
             (cb (lambda (res)
                   (let ((its (mapcar (lambda (tp)
                                        (espotify--type-items res tp))
                                      types)))
                     (apply callback its)))))
        (espotify-search cb term types filter)))

  #+end_src

  For example:

  #+begin_src emacs-lisp :load no :noweb-ref no
    (defvar espotify-query-result nil)
    (espotify-search* (lambda (al ar)
                        (message "Found %s albums, %s artists"
                                 (length al) (length ar))
                        (setq espotify-query-result (cons al ar)))
                     "blue turtles"
                     '(album artist))
    (sit-for 0)
    (list (mapcar 'car (car (car espotify-query-result)))
          (mapcar 'car (car (cdr espotify-query-result))))
  #+end_src

  #+RESULTS:
  | album_type    | artists   | available_markets | external_urls | href | id     | images | name       | release_date | release_date_precision | total_tracks | type | uri |
  | external_urls | followers | genres            | href          | id   | images | name   | popularity | type         | uri                    |              |      |     |

  Another strategy would be to search for several types and pass to
  our callback the concatenation of all items:

  #+begin_src emacs-lisp
    (defun espotify-search-all (callback term &optional types filter)
      "Like `espotify-search', but CALLBACK receives a single list of results."
      (let ((types (or types '(album track artist playlist))))
        (espotify-search* (lambda (&rest items)
                            (funcall callback (apply 'append items)))
                          term
                          types
                          filter)))

  #+end_src

* Listing user resources in the Spotify API
  :PROPERTIES:
  :header-args: :noweb-ref no
  :END:

  It is also possible to obtain lists of items of a given type for the
  current user, with a standard URL format:

  #+begin_src emacs-lisp
    (defun espotify--make-user-url (type)
      (format "%s/me/%ss" espotify-spotify-api-url (symbol-name type)))

  #+end_src

  and we can then use ~espotify-get~ to offer access to our playlists,
  albums, etc.:

  #+begin_src emacs-lisp

    (defun espotify-with-user-resources (callback type)
      (espotify-get (lambda (res) (funcall callback (alist-get 'items res)))
                    (espotify--make-user-url type)))
  #+end_src

  We're not using these functions in our packages, though, because we
  are authenticating ourselves using an application token, not as a
  user.

