readme.org
* Sending commands to local players
  :PROPERTIES:
  :header-args: :noweb-ref espotify-body
  :END:

  Once we now the URI we want to play (that ~uri~ entry in our items),
  sending it to a local player via DBUS is fairly easy.  Let's
  define a couple of customizable variables pointing to the service
  name and bus:

  #+begin_src emacs-lisp :noweb-ref espotify-customization
    (defcustom espotify-service-name "mopidy"
      "Name of the DBUS service used by the client we talk to.

    The official Spotify client uses `spotify', but one can also use
    alternative clients such as mopidy or spotifyd."
      :type 'string)

    (defcustom espotify-use-system-bus-p t
      "Whether to access the spotify client using the system DBUS."
      :type 'boolean)

  #+end_src

  and then using the Emacs DBUS API to send methods to it is a
  breeze:

  #+begin_src emacs-lisp
    (defun espotify-call-spotify-via-dbus (method &rest args)
      "Tell Spotify to execute METHOD with ARGS through DBUS."
      (apply #'dbus-call-method `(,(if espotify-use-system-bus-p :system :session)
                                  ,(format "org.mpris.MediaPlayer2.%s"
                                           espotify-service-name)
                                  "/org/mpris/MediaPlayer2"
                                  "org.mpris.MediaPlayer2.Player"
                                  ,method
                                  ,@args)))

    (defun espotify-play-uri (uri)
      "Use `espotify-call-spotify-via-dbus' to play a URI denoting a resource."
      (espotify-call-spotify-via-dbus "OpenUri" uri))

  #+end_src

    Although we're not going to use them explicitly below, we can define
  a couple more commands that may come in handy:

  #+begin_src emacs-lisp
    ;;;###autoload
    (defun espotify-play-pause ()
      "Toggle default Spotify player via DBUS."
      (interactive)
      (espotify-call-spotify-via-dbus "PlayPause"))

    ;;;###autoload
    (defun espotify-next ()
      "Tell default Spotify player to play next track via DBUS."
      (interactive)
      (espotify-call-spotify-via-dbus "Next"))

    ;;;###autoload
    (defun espotify-previous ()
      "Tell default Spotify player to play previous track via DBUS."
      (interactive)
      (espotify-call-spotify-via-dbus "Previous"))

   #+end_src

* Search front-end using consult
  :PROPERTIES:
  :header-args: :noweb-ref consult-body
  :END:

  I was exploring [[https://github.com/minad/consult][consult.el]] (and friends) to replace ivy/counsel,
  inspired in part by [[https://protesilaos.com/codelog/2021-01-06-emacs-default-completion/][Protesilaos Stavrou's musings]], and liking a
  lot what i see.  Up till now, everything i had with counsel is
  supported, often in better ways, with one exception: completing
  search of spotify albums using [[https://github.com/Lautaro-Garcia/counsel-spotify][counsel-spotify]].  So let's fix that
  by defining an asynchronous consult function that does precisely
  that!

  The top-level command will have this form:

  #+begin_src emacs-lisp
    (defvar consult-spotify-history nil)

    (defun consult-spotify-by (type &optional filter)
      (let ((orderless-matching-styles '(orderless-literal)))
        (consult--read (espotify--search-generator type filter)
                       :prompt (format "Search %ss: " type)
                       :lookup 'espotify--consult-lookup
                       :category 'espotify-search-item
                       :history 'consult-spotify-history
                       :initial consult-async-default-split
                       :require-match t)))

  #+end_src

  where we can write an asynchronous generator of search results
  with the helper function:

  #+begin_src emacs-lisp

    (defun espotify--search-generator (type filter)
      (thread-first (consult--async-sink)
        (consult--async-refresh-immediate)
        (consult--async-map #'espotify--format-item)
        (espotify--async-search type filter)
        (consult--async-throttle)
        (consult--async-split)))

  #+end_src

  The above follows a generic consult pattern, where all functions
  are pre-defined for us except ~espotify--async-search~, an
  asynchronous dispatcher closure that must generate and handle a
  list of candidates, responding to a set of action messages (init,
  reset, get, flush, etc.). Here's its definition in our
  case:

  #+begin_src emacs-lisp

    (defun espotify--async-search (next type filter)
      (let ((current ""))
        (lambda (action)
          (pcase action
            ((pred stringp)
             (when-let (term (espotify-check-term current action))
               (setq current term)
               (espotify-search-all
                (lambda (x)
                  (funcall next 'flush)
                  (funcall next x))
                current
                type
                filter)))
            (_ (funcall next action))))))

  #+end_src

  We have introduced the convention that we're only launching a search
  when the input string ends in "=", to avoid piling on HTTP
  requests, and also played a bit with Levenshtein distance, both via
  the function =espotify-check-search-term=:

  #+begin_src emacs-lisp
    (defvar espotify-search-suffix "="
      "Suffix in the search string launching an actual Web query.")

    (defvar espotify-search-threshold 8
      "Threshold to automatically launch an actual Web query.")

    (defun espotify-check-term (prev new)
      (when (not (string-blank-p new))
        (cond ((string-suffix-p espotify-search-suffix new)
               (substring new 0 (- (length new) (length espotify-search-suffix))))
              ((>= (string-distance prev new) espotify-search-threshold) new))))
  #+end_src

  When processing the results, we format them as a displayable string,
  while hiding in a property the URI that will allow us to play the
  item (and pass the formatter to ~consult-async--map~, in
  ~espotify--search-generator~ above):

  #+begin_src emacs-lisp

    (defun espotify--additional-info (x)
      (mapconcat 'identity
                 (seq-filter 'identity
                             `(,(alist-get 'name (alist-get 'album x))
                               ,(alist-get 'name (car (alist-get 'artists x)))
                               ,(alist-get 'display_name (alist-get 'owner x))))
                 ", "))

    (defun espotify--format-item (x)
      (propertize (format "%s%s"
                          (alist-get 'name x)
                          (if-let ((info (espotify--additional-info x)))
                              (format " (%s)" info)
                            ""))
                  'espotify-item x))

    (defun espotify--item (cand)
      (get-text-property 0 'espotify-item cand))

    (defun espotify--uri (cand)
      (alist-get 'uri (espotify--item cand)))

   #+end_src

   and then we make sure that we access that original string when
   consult looks up for it using the ~:lookup~ function, which we can
   simply define as:

   #+begin_src emacs-lisp

     (defun espotify--consult-lookup (_input cands cand)
       (seq-find (lambda (x) (string= cand x)) cands))

   #+end_src


   With that, when we receive the final result from ~consult--read~,
   we can play the selected URI right away:

   #+begin_src emacs-lisp

     (defun espotify--maybe-play (cand)
       (when-let (uri (when cand (espotify--uri cand)))
         (espotify-play-uri uri)))

   #+end_src

   And here, finally, are our interactive command to search and play
   albums using consult:

   #+begin_src emacs-lisp

     ;;;###autoload
     (defun consult-spotify-album (&optional filter)
       (interactive)
       (espotify--maybe-play (consult-spotify-by 'album filter)))

   #+end_src

   And likewise for playlists, artists and combinations thereof:

   #+begin_src emacs-lisp

     ;;;###autoload
     (defun consult-spotify-artist (&optional filter)
       (interactive)
       (espotify--maybe-play (consult-spotify-by 'artist filter)))

     ;;;###autoload
     (defun consult-spotify-track (&optional filter)
       (interactive)
       (espotify--maybe-play (consult-spotify-by 'track filter)))

     ;;;###autoload
     (defun consult-spotify-playlist (&optional filter)
       (interactive)
       (espotify--maybe-play (consult-spotify-by 'playlist filter)))

   #+end_src

   Our package is ready!

