espotify.el

(defun espotify-call-spotify-via-dbus (method &rest args)
  "Tell Spotify to execute METHOD with ARGS through DBUS."
  (apply #'dbus-call-method `(,(if espotify-use-system-bus-p :system :session)
                              ,(format "org.mpris.MediaPlayer2.%s"
                                       espotify-service-name)
                              "/org/mpris/MediaPlayer2"
                              "org.mpris.MediaPlayer2.Player"
                              ,method
                              ,@args)))

(defun espotify-play-uri (uri)
  (espotify-call-spotify-via-dbus "OpenUri" uri))

;;;###autoload
(defun espotify-play-pause ()
  (interactive)
  (espotify-call-spotify-via-dbus "PlayPause"))

;;;###autoload
(defun espotify-next ()
  (interactive)
  (espotify-call-spotify-via-dbus "Next"))

;;;###autoload
(defun espotify-previous ()
  (interactive)
  (espotify-call-spotify-via-dbus "Previous"))

(defvar espotify-search-suffix "="
  "Suffix in the search string launching an actual Web query.")

(defvar espotify-search-threshold 8
  "Threshold to automatically launch an actual Web query.")

(defun espotify-check-term (prev new)
  (when (not (string-blank-p new))
    (cond ((string-suffix-p espotify-search-suffix new)
           (substring new 0 (- (length new) (length espotify-search-suffix))))
          ((>= (string-distance prev new) espotify-search-threshold) new))))

(defun espotify--additional-info (x)
  (mapconcat 'identity
             (seq-filter 'identity
                         `(,(alist-get 'name (alist-get 'album x))
                           ,(alist-get 'name (car (alist-get 'artists x)))
                           ,(alist-get 'display_name (alist-get 'owner x))))
             ", "))

(defun espotify--format-item (x)
  (propertize (format "%s%s"
                      (alist-get 'name x)
                      (if-let ((info (espotify--additional-info x)))
                          (format " (%s)" info)
                        ""))
              'espotify-item x))

(defun espotify--item (cand)
  (get-text-property 0 'espotify-item cand))

(defun espotify--uri (cand)
  (alist-get 'uri (espotify--item cand)))


(defun espotify--maybe-play (cand)
  (when-let (uri (when cand (espotify--uri cand)))
    (espotify-play-uri uri)))
