readme.org
* Adding metadata to candidates using Marginalia
  :PROPERTIES:
  :header-args: :noweb-ref consult-body
  :END:

  Let's add metadata fields to our candidates, so that packages like
  [[https://github.com/minad/marginalia][Marginalia]] can offer it to consult or selectrum.

  #+begin_src emacs-lisp

    (defun espotify-marginalia-annotate (cand)
      (when-let (x (espotify--item cand))
        (marginalia--fields
         ((alist-get 'type x "") :face 'marginalia-mode :width 10)
         ((if-let (d (alist-get 'duration_ms x))
              (let ((secs (/ d 1000)))
                (format "%02d:%02d" (/ secs 60) (mod secs 60)))
            ""))
         ((if-let (d (alist-get 'total_tracks x)) (format "%s tracks" d) "")
          :face 'marginalia-size :width 12)
         ((if-let (d (alist-get 'release_date (alist-get 'album x x)))
              (format "%s" d)
            "")
          :face 'marginalia-date :width 10))))

    (add-to-list 'marginalia-annotators-heavy
                 '(espotify-search-item . espotify-marginalia-annotate))

  #+end_src

* Embark actions
  :PROPERTIES:
  :header-args: :noweb-ref embark-body
  :END:

  In addition to the default action (play the URI in the selected
  candidate), we can use embark to define other operations.  For
  instance, we could print the full item alist in its own buffer, or
  always look for an album to play.  These actions need access to the
  rich metadata attached to the candidate, and will therefore be
  defined as regular one-argument functions, rather than interactive
  commands (as is otherwise recommended for generic embark actions).

  #+begin_src emacs-lisp
    (defun espotify--show-info (candidate)
      "Show low-level info (an alist) about selection."
      (pop-to-buffer (get-buffer-create "*espotify info*"))
      (read-only-mode -1)
      (delete-region (point-min) (point-max))
      (insert (propertize candidate 'face 'bold))
      (newline)
      (when-let (item (espotify--item candidate))
        (insert (pp-to-string item)))
      (newline)
      (goto-char (point-min))
      (read-only-mode 1))

    (defun espotify--play-album (candidate)
      "Play album associated with selected item."
      (when-let (item (espotify--item candidate))
        (if-let (album (if (string= "album" (alist-get 'type item ""))
                           item
                         (alist-get 'album item)))
            (espotify-play-uri (alist-get 'uri album))
          (error "No album for %s" (alist-get 'name item)))))

    (defun espotify--yank-url (candidate)
      "Add to kill ring the Spotify URL of this entry"
      (when-let (item (espotify--item candidate))
        (if-let (url (alist-get 'spotify (alist-get 'external_urls item)))
            (kill-new url)
          (message "No spotify URL for this candidate"))))

    (embark-define-keymap espotify-item-keymap
      "Actions for Spotify search results"
      ("y" espotify--yank-url)
      ("a" espotify--play-album)
      ("h" espotify--show-info))

    (defun espotify--annotate-item (cand)
      (setq espotify--current-item (espotify--item cand))
      (cons 'espotify-search-item cand))

    (add-to-list 'embark-keymap-alist
                 '(espotify-search-item . espotify-item-keymap))
  #+end_src
* Appendix: reimplementing the ivy/counsel interface
  :PROPERTIES:
  :header-args: :tangle espotify-counsel.el
  :END:

  If you are an ivy/counsel user, you don't need any of the above:
  [[https://github.com/Lautaro-Garcia/counsel-spotify][counsel-spotify]] implements similar functionality.  But i found
  instructive to figure out how espotify can be used to reimplement
  it.  It's pretty simple.

  #+begin_src emacs-lisp
  ;;; counsel-espotify.el - counsel and spotify -  -*- lexical-binding: t; -*-
  (require 'espotify)
  (require 'ivy)

  (declare espotify--maybe-play)
  (declare espotify--format-item)
  (declare espotify--item)

  #+end_src

  We will use =ivy-read= to access the completion interface, with the
  flag =dynamic-collection= set.  Ivy will wait until we call
  =ivy-candidate-updates= with our items.

  #+begin_src emacs-lisp

    (defun espotify-counsel--search-by (type filter)
      (let ((current-term ""))
        (lambda (term)
          (when-let (term (espotify-check-term current-term term))
            (espotify-search-all (lambda (its)
                                   (let ((cs (mapcar #'espotify--format-item its)))
                                     (ivy-update-candidates cs)))
                                 (setq current-term term)
                                 type
                                 filter))
          0)))

   #+end_src

  With that, we can define our generic completing read:

  #+begin_src emacs-lisp

    (defun espotify-counsel--play-album (candidate)
      "Play album associated with selected item."
      (interactive "s")
      (let ((item (espotify--item candidate)))
        (if-let (album (if (string= "album" (alist-get 'type item ""))
                           item
                         (alist-get 'album item)))
            (espotify-play-uri (alist-get 'uri album))
          (error "No album for %s" (alist-get 'name item)))))

    (defun espotify-counsel-search-by (type filter)
      (ivy-read (format "Search %s: " type)
                (espotify-counsel--search-by type filter)
                :dynamic-collection t
                :action `(1 ("a" espotify-counsel--play-album "Play album")
                            ("p" espotify--maybe-play ,(format "Play %s" type)))))
  #+end_src

  and our collection of searching commands:

  #+begin_src emacs-lisp
    (defun espotify-counsel-album (&optional filter)
      (interactive)
      (espotify-counsel-search-by 'album filter))

    (defun espotify-counsel-artist (&optional filter)
      (interactive)
      (espotify-counsel-search-by 'artist filter))

    (defun espotify-counsel-track (&optional filter)
      (interactive)
      (espotify-counsel-search-by 'track filter))

    (defun espotify-counsel-playlist (&optional filter)
      (interactive)
      (espotify-counsel-search-by 'playlist filter))

    (provide 'counsel-espotify)

  #+end_src

  Simpler than our initial consult, although it's true that we already
  had part of the job done. The nice "split search" that counsult
  offers out of the box, though, is much more difficult to get.

* Packages
*** espotify.el (generic utilities)
    #+begin_src emacs-lisp :tangle espotify.el
      ;;; espotify.el --- Spotify access library  -*- lexical-binding: t; -*-

      <<author-boilerplate>>
      ;; Package-Requires: ((emacs "26.1"))

      <<license>>

      ;;; Comentary:

      ;; This package provides generic utilities to access Spotify and use
      ;; its query APIs, as well as controlling local players via their
      ;; dbus interface.  Although they can be used in other programs,
      ;; the functions in this package are intended for espotify-counsel
      ;; and embark-spotify.

      ;; This file has been automatically generated from the literate program
      ;; https://codeberg.org/jao/espotify/src/branch/main/readme.org

      ;;; Code:

      <<espotify-customization>>

      <<espotify-body>>

      (provide 'espotify)
      ;;; espotify.el ends here
    #+end_src
*** consult-spotify.el
    #+begin_src emacs-lisp :tangle consult-spotify.el
      ;;; consult-spotify.el --- Spotify queries using consult  -*- lexical-binding: t; -*-

      <<author-boilerplate>>
      ;; Package-Requires: ((emacs "26.1") (consult "0.5") (marginalia "0.3") (espotify "0.1"))

      <<license>>

      ;;; Comentary:

      ;; This package provides functions to interactively query
      ;; Spotify using consult.  Its main entry points are the
      ;; commands `consult-spotify-album', `consult-spotify-artist',
      ;; `consult-spotify-playlist' and `consult-spotify-track'

      ;; This file has been automatically generated from the literate program
      ;; https://codeberg.org/jao/espotify/src/branch/main/readme.org

      ;;; Code:

      (require 'seq)
      (require 'espotify)
      (require 'consult)
      (require 'marginalia)

      <<consult-body>>

      (provide 'consult-spotify)
      ;;; consult-spotify.el ends here
    #+end_src
*** embark-spotify.el
    #+begin_src emacs-lisp :tangle embark-spotify.el
      ;;; embark-spotify.el --- Embark actions for espotify  -*- lexical-binding: t; -*-

      <<author-boilerplate>>
      ;; Package-Requires: ((emacs "26.1") (consult-spotify "0.1") (embark "0.10"))

      <<license>>

      ;;; Comentary:

      ;; This package provides embark actions to invoke when using
      ;; the commands in consult-spotify.

      ;; This file has been automatically generated from the literate program
      ;; https://codeberg.org/jao/espotify/src/branch/main/readme.org

      ;;; Code:

      (require 'consult-spotify)
      (require 'embark)

      <<embark-body>>

      (provide 'embark-spotify)
      ;;; embark-spotify.el ends here
    #+end_src

*** Author
    #+begin_src emacs-lisp :noweb-ref author-boilerplate
      ;; Author: Jose A Ortega Ruiz <jao@gnu.org>
      ;; Maintainer: Jose A Ortega Ruiz
      ;; Keywords: media
      ;; License: GPL-3.0-or-later
      ;; Version: 0.1
      ;; Homepage: https://codeberg.org/jao/espotify
    #+end_src

*** License

    #+begin_src emacs-lisp :noweb-ref license
      ;; Copyright (C) 2021  Jose A Ortega Ruiz

      ;; This program is free software; you can redistribute it and/or modify
      ;; it under the terms of the GNU General Public License as published by
      ;; the Free Software Foundation, either version 3 of the License, or
      ;; (at your option) any later version.

      ;; This program is distributed in the hope that it will be useful,
      ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
      ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
      ;; GNU General Public License for more details.

      ;; You should have received a copy of the GNU General Public License
      ;; along with this program.  If not, see <https://www.gnu.org/licenses/>.
    #+end_src

* Acknowledgements

  The code above benefited quite a bit from Daniel Mendler's and Antolin
  Omar Camarena's comments, and i discussed a bit its evolution and
  other possibilities offered by the consult API [[https://jao.io/blog/2021-01-21-consulting-spotify-in-a-better-way.html][in this blog post]].

  I am stealing most of the ideas on how to establish authenticated
  connections to the Spotify API and performing queries from
  [[https://github.com/Lautaro-Garcia/counsel-spotify][counsel-spotify]], with many simplifications.
