consult-spotify.el


(defun espotify-marginalia-annotate (cand)
  (when-let (x (espotify--item cand))
    (marginalia--fields
     ((alist-get 'type x "") :face 'marginalia-mode :width 10)
     ((if-let (d (alist-get 'duration_ms x))
          (let ((secs (/ d 1000)))
            (format "%02d:%02d" (/ secs 60) (mod secs 60)))
        ""))
     ((if-let (d (alist-get 'total_tracks x)) (format "%s tracks" d) "")
      :face 'marginalia-size :width 12)
     ((if-let (d (alist-get 'release_date (alist-get 'album x x)))
          (format "%s" d)
        "")
      :face 'marginalia-date :width 10))))

(add-to-list 'marginalia-annotators-heavy
             '(espotify-search-item . espotify-marginalia-annotate))


(provide 'consult-spotify)
;;; consult-spotify.el ends here
